Project/Toir/src/Catalogs/торо_ТехнологическиеОперации/торо_ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТехнологическиеОперации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опасная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПовышеннойОпасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_СоставИерархическихТехКартРемонтов/торо_СоставИерархическихТехКартРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоставИерархическихТехКартРемонтов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состав</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СпособыРасчетаПродолжительности/торо_СпособыРасчетаПродолжительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СпособыРасчетаПродолжительности</name>
  <enumValues>
    <name>ПоНормамВремениТехОпераций</name>
  </enumValues>
  <enumValues>
    <name>ПоНормамТрудозатрат</name>
  </enumValues>
  <enumValues>
    <name>ПоПродолжительностиОперацийРемонтов</name>
  </enumValues>
  <enumValues>
    <name>ПоПродолжительностиТехКарт</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольноеЗначение</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/УпаковкиНоменклатуры/УпаковкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостоитИзДругихУпаковок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ТехнологическиеОперации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.торо_ФормаПодбораПродолжительности" Тогда
		Элементы.ГиперссылкаНормаВремени.Заголовок = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(ВыбранноеЗначение);
		Объект.НормаВремени = ВыбранноеЗначение;
		Модифицированность = Истина;
	ИначеЕсли ИсточникВыбора.Имяформы = "Обработка.торо_ПодборНоменклатуры.Форма.Форма" Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаМатериальныеЗатраты Тогда
			ИмяТЧ = "МатериальныеЗатраты";
			ИмяРеквизита = "Номенклатура";
		Иначе
			ИмяТЧ = "ИнструментыИТехника";
			ИмяРеквизита = "Инструмент";
		КонецЕсли;
		
		ДобавитьНоменклатуруИзПодбора(ВыбранноеЗначение, ИмяТЧ, ИмяРеквизита);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
			
			Объект.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ВалютыУчета = Константы.ВалютаУправленческогоУчета.Получить();
	
	Для каждого Стр Из Объект.ТрудовыеЗатраты Цикл
		
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
		
	КонецЦикла;
	
	Для каждого Стр Из Объект.ИнструментыИТехника Цикл
		
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
		
	КонецЦикла;
	
	УстановитьУсловноеОформление();
	
	ОпаснаяИсх = Объект.Опасная;
	РаботаПовышеннойОпасностиИсх = Объект.РаботаПовышеннойОпасности;
	
	// СтандартныеПодсистемы.Свойства
	Контекст = Новый Структура();
	Контекст.Вставить("Объект",                     Объект);
	Контекст.Вставить("ИмяЭлементаДляРазмещения",   "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Контекст);
	// Конец СтандартныеПодсистемы.Свойства
	
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Элементы.ГиперссылкаНормаВремени.Заголовок = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Объект.НормаВремени);	
	ОбновитьНадписьВалюта();
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
		Элементы.РасценкаВВалютеУчета.Заголовок = СформироватьРасценкаВВалютеУчёта(Объект.Расценка, Объект.Валюта, ВалютыУчета);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Для каждого Стр Из Объект.ТрудовыеЗатраты Цикл
		
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
		
	КонецЦикла;
	
	Для каждого Стр Из Объект.ИнструментыИТехника Цикл
		
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
		
	КонецЦикла;
	
	СлужебныеРеквизитыЗаполнитьНаСервере();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Для каждого Стр Из Объект.ТрудовыеЗатраты Цикл
		
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
		
	КонецЦикла;
	
	Для каждого Стр Из Объект.ИнструментыИТехника Цикл
		
		Стр.ВремяРаботыТекст = СформироватьПродолжительность(Стр.ВремяРаботы);
		
	КонецЦикла;
	
	ФОИспользоватьОпасноеПроизводство = ПолучитьФункциональнуюОпцию("торо_ИспользоватьОпасноеПроизводство");
	ФОИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно = ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно");
	
	Если (ФОИспользоватьОпасноеПроизводство И ТекущийОбъект.Опасная <> ОпаснаяИсх) 
		ИЛИ (ФОИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно И ТекущийОбъект.РаботаПовышеннойОпасности <> РаботаПовышеннойОпасностиИсх) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ТехКартыСписокОпераций.Ссылка КАК ТехКарта
		|ПОМЕСТИТЬ ТехКарты
		|ИЗ
		|	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
		|ГДЕ
		|	торо_ТехКартыСписокОпераций.Операция = &Операция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_СоставИерархическихТехКартРемонтов.ТехКарта КАК ТехКартаВУ
		|ПОМЕСТИТЬ ВсеТехКартыДляИзменения
		|ИЗ
		|	ТехКарты КАК ТехКарты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
		|		ПО ТехКарты.ТехКарта = торо_СоставИерархическихТехКартРемонтов.Состав
		|ГДЕ
		|	НЕ торо_СоставИерархическихТехКартРемонтов.ТехКарта В
		|				(ВЫБРАТЬ
		|					ТехКарты.ТехКарта
		|				ИЗ
		|					ТехКарты КАК ТехКарты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТехКарты.ТехКарта
		|ИЗ
		|	ТехКарты КАК ТехКарты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеТехКартыДляИзменения.ТехКартаВУ КАК ТехКарта,
		|	СУММА(ВЫБОР
		|			КОГДА торо_СоставИерархическихТехКартРемонтов.Состав ЕСТЬ NULL 
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Приоритет
		|ИЗ
		|	ВсеТехКартыДляИзменения КАК ВсеТехКартыДляИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
		|		ПО ВсеТехКартыДляИзменения.ТехКартаВУ = торо_СоставИерархическихТехКартРемонтов.Состав
		|			И (торо_СоставИерархическихТехКартРемонтов.ТехКарта В
		|				(ВЫБРАТЬ
		|					ТехКарты.ТехКартаВУ
		|				ИЗ
		|					ВсеТехКартыДляИзменения КАК ТехКарты))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеТехКартыДляИзменения.ТехКартаВУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
		
		Запрос.УстановитьПараметр("Операция", ТекущийОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если ФОИспользоватьОпасноеПроизводство Тогда
					Если НЕ Выборка.ТехКарта.СодержитОпасныеОперации И ТекущийОбъект.Опасная Тогда
						
						ТехКартаОбъект = Выборка.ТехКарта.ПолучитьОбъект();
						ТехКартаОбъект.СодержитОпасныеОперации = Истина;
						ТехКартаОбъект.Записать();
						
					ИначеЕсли Выборка.ТехКарта.СодержитОпасныеОперации И НЕ ТекущийОбъект.Опасная Тогда
						
						МассивОпераций = Новый Массив;
						
						Для каждого Стр Из Выборка.ТехКарта.СписокОпераций Цикл
							
							МассивОпераций.Добавить(Стр.Операция);
							
						КонецЦикла; 
						
						ЕстьОпасныеОперации = ПроверитьНаличиеОпасныхОперацийНаСервере(МассивОпераций,Выборка.ТехКарта.ДатаПринятия);
						
						Если НЕ ЕстьОпасныеОперации Тогда
							
							ТехКартаОбъект = Выборка.ТехКарта.ПолучитьОбъект();
							ТехКартаОбъект.СодержитОпасныеОперации = Ложь;
							ТехКартаОбъект.Записать();
							
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				Если ФОИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно Тогда
					Если НЕ Выборка.ТехКарта.СодержитРаботыПовышеннойОпасности И ТекущийОбъект.РаботаПовышеннойОпасности Тогда
						
						ТехКартаОбъект = Выборка.ТехКарта.ПолучитьОбъект();
						ТехКартаОбъект.СодержитРаботыПовышеннойОпасности = Истина;
						ТехКартаОбъект.Записать();
						
					ИначеЕсли Выборка.ТехКарта.СодержитРаботыПовышеннойОпасности И НЕ ТекущийОбъект.РаботаПовышеннойОпасности Тогда
						
						МассивОпераций = Новый Массив;
						
						Для каждого Стр Из Выборка.ТехКарта.СписокОпераций Цикл
							
							МассивОпераций.Добавить(Стр.Операция);
							
						КонецЦикла; 
						
						ЕстьРаботыПовышеннойОпасности = ПроверитьНаличиеРаботПовышеннойОпасностиНаСервере(МассивОпераций, Выборка.ТехКарта.ДатаПринятия);
						
						Если НЕ ЕстьРаботыПовышеннойОпасности Тогда
							
							ТехКартаОбъект = Выборка.ТехКарта.ПолучитьОбъект();
							ТехКартаОбъект.СодержитРаботыПовышеннойОпасности = Ложь;
							ТехКартаОбъект.Записать();
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ОпаснаяИсх = ТекущийОбъект.Опасная;
	РаботаПовышеннойОпасностиИсх = ТекущийОбъект.РаботаПовышеннойОпасности;
	СлужебныеРеквизитыЗаполнитьНаСервере();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РасценкаПриИзменении(Элемент)
	
	Элементы.РасценкаВВалютеУчета.Заголовок = СформироватьРасценкаВВалютеУчёта(Объект.Расценка, Объект.Валюта, ВалютыУчета);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНадписьНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВалютаНажатиеЗавершение", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.Валюты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПродолжительностиПриИзменении(Элемент)
	
	Если Объект.СпособРасчетаПродолжительности = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Объект.СпособРасчетаПродолжительности = ПредопределенноеЗначение("Перечисление.торо_СпособыРасчетаПродолжительности.ПоНормамТрудозатрат") Тогда 
		Модифицированность = Истина;
		Объект.НормаВремени = РассчитатьПродолжительностьПоТрудозатратам();
		Элементы.ГиперссылкаНормаВремени.Заголовок = торо_ОбщегоНазначенияКлиентСервер.СформироватьЗаголовокПоПродолжительности(Объект.НормаВремени);
		
	ИначеЕсли Объект.СпособРасчетаПродолжительности = ПредопределенноеЗначение("Перечисление.торо_СпособыРасчетаПродолжительности.ПроизвольноеЗначение") Тогда
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(Объект.НормаВремени, ЭтаФорма, Объект.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнструментыИТехника

&НаКлиенте
Процедура ИнструментыИТехникаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		
		ТекДанные = Элементы.ИнструментыИТехника.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекДанные.Инструмент) Тогда
				ТекстСообщения = НСтр("es='¡Campo ""el Instrumento"" no puede ser vacío!';ru='Поле ""Инструмент"" не может быть пустым!';en='""Tool"" field cannot be empty!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
			Если Объект.ИнструментыИТехника.Количество() > 1 Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Инструмент", ТекДанные.Инструмент); 
				ДублиИнструментов = Объект.ИнструментыИТехника.НайтиСтроки(Отбор);
				Если ДублиИнструментов.Количество()>1 Тогда 
					ШаблонСообщения = НСтр("es='El instrumento ""%1"" es añadido ya';ru='Инструмент ""%1"" уже добавлен';en=""Tool '%1' has already been added""");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Инструмент);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИТехникаУпаковкаПриИзменении(Элемент)
	ТекДанные = Элементы.ИнструментыИТехника.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ТекДанные.ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияНаСервере(ТекДанные.Упаковка);
		ТекДанные.Количество = ТекДанные.КоличествоУпаковок * ПолучитьКоэффициентУпаковкиНаСервере(ТекДанные.Упаковка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИТехникаКоличествоУпаковокПриИзменении(Элемент)
	ТекДанные = Элементы.ИнструментыИТехника.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ПриСменеЗначенийКоличествИлиУпаковки(ТекДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИТехникаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ИнструментыИТехникаВремяРаботыТекст" Тогда
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(Элементы.ИнструментыИТехника.ТекущиеДанные.ВремяРаботы,Элемент, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИТехникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Число") Тогда
		ТекДанные.ВремяРаботы = ВыбранноеЗначение;
		ТекДанные.ВремяРаботыТекст = СформироватьПродолжительность(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтрументыИТехникаУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьДанныеВыбораУпаковки(Элементы.ИнструментыИТехника.ТекущиеДанные.Инструмент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТрудовыеЗатраты

&НаКлиенте
Процедура ТрудовыеЗатратыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		
		ТекДанные = Элементы.ТрудовыеЗатраты.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекДанные.Квалификация) Тогда
				ТекстСообщения = НСтр("es='¡Campo ""la Calificación"" no puede ser vacío!';ru='Поле ""Квалификация"" не может быть пустым!';en='""Qualification"" field cannot be empty!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
			Если Объект.ТрудовыеЗатраты.Количество() > 1 Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Квалификация", ТекДанные.Квалификация); 
				ДублиКвалификации = Объект.ТрудовыеЗатраты.НайтиСтроки(Отбор);
				Если ДублиКвалификации.Количество()>1 Тогда 
					ШаблонСообщения = НСтр("es='La calificación ""%1"" es añadida ya';ru='Квалификация ""%1"" уже добавлена';en='Qualification ""%1"" has already been added'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Квалификация);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТрудовыеЗатратыВремяРаботыТекст" Тогда
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(Элементы.ТрудовыеЗатраты.ТекущиеДанные.ВремяРаботы,Элемент, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Число") Тогда
		ТекДанные.ВремяРаботы = ВыбранноеЗначение;
		ТекДанные.ВремяРаботыТекст = СформироватьПродолжительность(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыВремяРаботыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ФормаПодбораПродолжительности = ПолучитьФорму("ОбщаяФорма.торо_ФормаПодбораПродолжительности", ,Элемент,,ВариантОткрытияОкна.ОтдельноеОкно); 
	
	ФормаПодбораПродолжительности.ПродолжительностьВСекундах = Элемент.Родитель.ТекущиеДанные.ВремяРаботы;
	ФормаПодбораПродолжительности.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеЗатратыВремяРаботыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элемент = ВыбранноеЗначение;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериальныеЗатраты

&НаКлиенте
Процедура МатериальныеЗатратыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		
		ТекДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
				ТекстСообщения = НСтр("es='¡Campo ""la Nomenclatura"" no puede ser vacío!';ru='Поле ""Номенклатура"" не может быть пустым!';en='""Nomenclature"" field cannot be empty!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
			
			Если Объект.МатериальныеЗатраты.Количество() >1 Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить ("Номенклатура", ТекДанные.Номенклатура);
				Отбор.Вставить("Характеристика", ТекДанные.Характеристика);
				ДублиНоменклатуры = Объект.МатериальныеЗатраты.НайтиСтроки(Отбор);
				Если ДублиНоменклатуры.Количество()>1 Тогда
					ШаблонСообщения = НСтр("es='La nomenclatura ""%1"" con tal característica es añadida ya';ru='Номенклатура ""%1"" с такой характеристикой уже добавлена';en='Nomenclature ""%1"" with this characteristic has already been added'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекДанные.Номенклатура);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				 КонецЕсли;
			 КонецЕсли;
			 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыУпаковкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ПриСменеЗначенийКоличествИлиУпаковки(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьДанныеВыбораУпаковки(Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ПриСменеЗначенийКоличествИлиУпаковки(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	
	ТекущаяСтрока.ХарактеристикиИспользуются = торо_НоменклатураСервер.ПолучитьХарактеристикиИспользуются(ТекущаяСтрока.Номенклатура);
	
	Если Не ТекущаяСтрока.ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.Характеристика = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",         Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                  Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                    Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",           Истина);
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаМатериальныеЗатраты Тогда
		ПараметрыФормы.Вставить("Заголовок",                                 НСтр("es='La selección de la nomenclatura';ru='Подбор номенклатуры';en='Item selection'"));
	Иначе
		ПараметрыФормы.Вставить("Заголовок",                                 НСтр("es='La selección de los instrumentos y la técnica';ru='Подбор инструментов и техники';en='Selection of tools and equipment'"));
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗаголовокКнопкиЗапрашиватьКоличествоИЦену", НСтр("es='Pedir la cantidad';ru='Запрашивать количество';en='Request quantity'"));
	ПараметрыФормы.Вставить("Дата",                                      ТекущаяДата());
	ПараметрыФормы.Вставить("Документ",                                  Объект.Ссылка);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования",				 "ПростойПодборНоменклатуры");
	
	ОткрытьФорму("Обработка.торо_ПодборНоменклатуры.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Перерассчитать(Команда)
	СпособРасчетаПродолжительностиПриИзменении(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	Если РольДоступна("ЧтениеНоменклатуры") Или РольДоступна("ПолныеПрава") Тогда
		// Чтобы не отображалась единица измерения в Материальных затратах, когда заполнена Упаковка.
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ИнтрументыИТехникаЕдиницаИзмерения.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ИнструментыИТехника.Упаковка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыНоменклатураЕдиницаИзмерения.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.Упаковка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);
		
		// Условное оформление для использования/неиспользования характеристик.
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериальныеЗатратыХарактеристика.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериальныеЗатраты.ХарактеристикиИспользуются");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.НейтральноСерый);
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("es='<las características no se usan>';ru='<характеристики не используются>';en='<характеристики не используются>'"));
		Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
		Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",Ложь);
		//
		
	КонецЕсли;

КонецПроцедуры // УстановитьУсловноеОформление()


&НаСервере
Процедура СлужебныеРеквизитыЗаполнитьНаСервере()
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
	Объект.МатериальныеЗатраты,
	Новый Структура("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются")));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораУпаковки(Номенклатура, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораУпаковки = Новый Структура("Номенклатура", Номенклатура);
	СтандартнаяОбработка = Ложь;
	ЗаполнитьДанныеВыбораУпаковкиСервер(ДанныеВыбора, ПараметрыВыбораУпаковки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеВыбораУпаковкиСервер(ДанныеВыбора, ПараметрыВыбора)

	ДанныеВыбора = Справочники.УпаковкиНоменклатуры.ПолучитьДанныеВыбора(ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьВалюта()
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
		Элементы.ВалютаНадпись.Заголовок = Объект.Валюта;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНажатиеЗавершение(ЗначениеВалюты, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеВалюты = Неопределено Тогда
		Объект.Валюта = ЗначениеВалюты;
		Модифицированность = Истина;
		Элементы.РасценкаВВалютеУчета.Заголовок = СформироватьРасценкаВВалютеУчёта(Объект.Расценка, Объект.Валюта, ВалютыУчета);
	КонецЕсли;
	ОбновитьНадписьВалюта();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		// >> [Деснол] [Ушаков А.Д.] [26.09.2019] 
		ПродолжительностьСтрокой = СтрШаблон(НСтр("es='%1 h. %2 min. %3 sec.';ru='%1 ч. %2 мин. %3 с.';en='%1 hr.%2 min. %3 s'"), Часы, Минуты, Секунды);
		Возврат ПродолжительностьСтрокой;
		//Возврат "" + Часы + " ч. " + Минуты + " м. " + Секунды + " с.";
		// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьРасценкаВВалютеУчёта(Знач Расценка, Знач Валюта, ВалютыУчета)
	
	Если Расценка = 0 Тогда
		
		Возврат "0,00";
		
	Иначе
		ВылютыРасценки = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта,ТекущаяДата());
		ВалютаУчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютыУчета,ТекущаяДата());
		
		Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Расценка,Валюта,ВалютыУчета,ВылютыРасценки.Курс,ВалютаУчета.Курс,ВылютыРасценки.Кратность,ВалютаУчета.Кратность);		
		
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияНаСервере(Упаковка)
	
	Возврат Упаковка.Владелец.ЕдиницаИзмерения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентУпаковкиНаСервере(Упаковка)
	
	Возврат Упаковка.Коэффициент;
	
КонецФункции

&НаСервере
Функция ПроверитьНаличиеРаботПовышеннойОпасностиНаСервере(Операции, ДатаПринятия)
	
	флЕстьРаботаПовышеннойОпасности = Ложь;
	Для каждого СтрокаМассива Из Операции Цикл
		Если ТипЗнч(СтрокаМассива) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			Если СтрокаМассива.РаботаПовышеннойОпасности Тогда
				флЕстьРаботаПовышеннойОпасности = Истина;
				Прервать;
			КонецЕсли;
		Иначе
			Таб = РегистрыСведений.торо_ВерсииТехКарт.СрезПоследних(ДатаПринятия, Новый Структура("ИдентификаторТехКарты", СтрокаМассива));
			
			Если Таб.Количество() > 0 Тогда
				Если Таб[0].ТехКарта.СодержитРаботыПовышеннойОпасности Тогда
					флЕстьРаботаПовышеннойОпасности = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат флЕстьРаботаПовышеннойОпасности;
	
КонецФункции

&НаСервере
Функция ПроверитьНаличиеОпасныхОперацийНаСервере(Операции, ДатаПринятия)
	
	флЕстьОпаснаяОперация = Ложь;
	Для каждого СтрокаМассива Из Операции Цикл
		Если ТипЗнч(СтрокаМассива) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			Если СтрокаМассива.Опасная Тогда
				флЕстьОпаснаяОперация = Истина;
				Прервать;
			КонецЕсли;
		Иначе
			Таб = РегистрыСведений.торо_ВерсииТехКарт.СрезПоследних(ДатаПринятия, Новый Структура("ИдентификаторТехКарты", СтрокаМассива));
			
			Если Таб.Количество() > 0 Тогда
				Если Таб[0].ТехКарта.СодержитОпасныеОперации Тогда
					флЕстьОпаснаяОперация = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат флЕстьОпаснаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПриСменеЗначенийКоличествИлиУпаковки(ТекущиеДанные, ИзменениеКоличестваЕдиниц = Ложь)
	
	КоэффициентУпаковки = ПолучитьКоэффициентУпаковкиНаСервере(ТекущиеДанные.Упаковка);	
	
	Если КоэффициентУпаковки = 0 Тогда
		КоэффициентУпаковки = 1;
	КонецЕсли; 
	
	Если ИзменениеКоличестваЕдиниц Тогда
		
		ТекущиеДанные.КоличествоУпаковок = ТекущиеДанные.Количество / КоэффициентУпаковки;
		
	Иначе	
		
		ТекущиеДанные.Количество = ТекущиеДанные.КоличествоУпаковок * КоэффициентУпаковки;
		
	КонецЕсли;
	
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере 
Процедура ДобавитьНоменклатуруИзПодбора(Адрес, ИмяТЧ, ИмяРеквизита)
	
	Тз = ПолучитьИзВременногоХранилища(Адрес);
	
	СтруктураДействий = Новый Структура;
	Для каждого текСтрока из Тз Цикл
		
		Если ИмяТЧ = "МатериальныеЗатраты" Тогда
			СтруктураПоиска = Новый Структура("Номенклатура, Характеристика", текСтрока.Номенклатура, текСтрока.Характеристика);
		Иначе
			СтруктураПоиска = Новый Структура("Инструмент", текСтрока.Номенклатура);
		КонецЕсли;
			
		НайС = Объект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
		КоэфУпаковкиВыбр = ?(ЗначениеЗаполнено(текСтрока.Упаковка), текСтрока.Упаковка.Коэффициент, 1);
		Если НайС.Количество() = 0 Тогда
			нс = Объект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(нс, текСтрока);
			нс[ИмяРеквизита] = текСтрока.Номенклатура;
			нс.Количество = текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр;
		Иначе
			
			нс = НайС[0];
			Если НЕ ЗначениеЗаполнено(нс.Упаковка)Тогда
				нс.КоличествоУпаковок = нс.КоличествоУпаковок + текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр;
			ИначеЕсли нс.Упаковка <> текСтрока.Упаковка Тогда
				нс.КоличествоУпаковок = нс.КоличествоУпаковок + текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр / ?(ЗначениеЗаполнено(нс.Упаковка), нс.Упаковка.Коэффициент, 1);
			Иначе
				нс.КоличествоУпаковок = нс.КоличествоУпаковок + текСтрока.КоличествоУпаковок;
			КонецЕсли;
			
			нс.Количество = нс.Количество + текСтрока.КоличествоУпаковок * КоэфУпаковкиВыбр;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыХарактеристикаСоздание(Элемент, СтандартнаяОбработка)
	Если Элементы.МатериальныеЗатраты.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура) Тогда
		Вид = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		СтруктураПараметров = Новый Структура("ВидНоменклатуры, Владелец", Вид, Элементы.МатериальныеЗатраты.ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента", СтруктураПараметров);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыХарактеристикаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеЗатратыХарактеристикаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.МатериальныеЗатраты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура, "ВидНоменклатуры");
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользованиеХарактеристик");
		ПараметрыПолученияДанных.Отбор.Очистить();
		Если ИспользованиеХарактеристик = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры") Тогда
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ВидНоменклатуры);
		Иначе
			ПараметрыПолученияДанных.Отбор.Вставить("Владелец", ТекущиеДанные.Номенклатура);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция РассчитатьПродолжительностьПоТрудозатратам()
	
	Продолжительность = 0;
	
	Для Каждого Строка Из Объект.ТрудовыеЗатраты Цикл
		Продолжительность = Продолжительность + Строка.ВремяРаботы*Строка.Количество;
	КонецЦикла; 
	
	Возврат Продолжительность;
	
КонецФункции

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");	
КонецПроцедуры

#КонецОбласти
